{
    "tasks": [
        {
            "name": "CSSTuning_GCC",
            "description": "The GNU Compiler Collection (GCC) is a collection of compilers from the GNU Project that support various programming languages, hardware architectures, and operating systems. The Free Software Foundation (FSF) distributes GCC as free software under the GNU General Public License (GNU GPL). GCC is a key component of the GNU toolchain which is used for most projects related to GNU and the Linux kernel. With roughly 15 million lines of code in 2019, GCC is one of the largest free programs in existence.[4] It has played an important role in the growth of free software, as both a tool and an example.",
            "num_vars": "5",
            "num_objs": "1",
            "workloads": "0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49",
            "budget_type": "function evaluations",
            "budget": "5"
        },
        {
            "name": "CSSTuning_LLVM",
            "description": "LLVM is a set of compiler and toolchain technologies that can be used to develop a frontend for any programming language and a backend for any instruction set architecture. LLVM is designed around a language-independent intermediate representation (IR) that serves as a portable, high-level assembly language that can be optimized with a variety of transformations over multiple passes. The name LLVM originally stood for Low Level Virtual Machine. However, the project has since expanded, and the name is no longer an acronym but an orphan initialism.",
            "num_vars": "5",
            "num_objs": "1",
            "workloads": "0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49",
            "budget_type": "function evaluations",
            "budget": "5"
        },
        {
            "name": "CSSTuning_MySQL",
            "description": "MySQL is an open-source relational database management system (RDBMS). Its name is a combination of \"My\", the name of co-founder Michael Widenius's daughter My, and \"SQL\", the acronym for Structured Query Language. A relational database organizes data into one or more data tables in which data may be related to each other; these relations help structure the data. SQL is a language that programmers use to create, modify and extract data from the relational database, as well as control user access to the database. In addition to relational databases and SQL, an RDBMS like MySQL works with an operating system to implement a relational database in a computer's storage system, manages users, allows for network access and facilitates testing database integrity and creation of backups.",
            "num_vars": "5",
            "num_objs": "1",
            "workloads": "0,1,2,3",
            "budget_type": "function evaluations",
            "budget": "50"
        }
    ],
    
    "optimizer": {
        "SearchSpace": {
            "type": "None",
            "auxiliaryData": [],
            "autoSelect": false
        },
        "Initialization": {
            "type": "random",
            "InitNum": 5,
            "auxiliaryData": [],
            "autoSelect": false
        },
        "AcquisitionFunction": {
            "type": "EI",
            "auxiliaryData": [],
            "autoSelect": false
        },
        "Pretrain": {
            "type": "None",
            "auxiliaryData": [],
            "autoSelect": false
        },
        "Model": {
            "type": "RGPE",
            "auxiliaryData": [],
            "autoSelect": true
        },
        "Normalizer": {
            "type": "Standard",
            "auxiliaryData": [],
            "autoSelect": false
        }
    },
    "seeds": "0",
    "remote": false,
    "server_url": "",
    "experimentName": "open_ended"
}